
# multiple pages param collect
page_num=range(2,5)
url='https://www.zhipin.com/web/geek/job?query=Java&city=101020100'
url_list=[]
for i in page_num:
    url_list.append(url+'&page='+str(i))
# print(url_list)



from selenium import webdriver
from time import sleep

def page_source_get(url):
    driver = webdriver.Firefox()
    driver.get('url')
    sleep(10)
    doc= driver.page_source
    return doc


# print(doc)
def elements_target(doc):
    from requests_html import HTML
    html=HTML(html=doc)
    ab=html.find('div.search-job-result',first=True)
    d=ab.find('li.job-card-wrapper')
    g=[i.text.split('\n') for i in d]
    return g

# print(g)

def file_write():
    return

def data_cleaning(data):
    # for i in data:
    #     i.remove('立即沟通')
    return 1

def test():
    doc=page_source_get(url)
    elements_target(doc)
    file_write()
    data_cleaning()


data=[['资深 Java上海·浦东新区·高行', '15-22K', '5-10年', '大专', '徐女士招聘专家', '立即沟通在线', '海橘', '计算机软件', '不需要融资', '100-499人', '后端工程师', 'Redis', 'MongoDB', 'Java开发经验', '分布式系统开发经 验', '多线程', '架构', '重构', '带薪年假，节日福利，五险一金，员工旅游，定期体检'], ['Java Leader上海·浦东新区·张江', '10-16K', '3-5年', '学历不限', '向先生CEO', '立即沟通', '上海云摩企业管理咨询', '计算机软件', '0-20人', 'Java', '团队管理', '英语'], ['Java leader上海·闵行区·虹桥', '25-50K', '5-10年', '本科', '张女士招聘者', '立即沟通', '职聊网', '移动互联网', '不需要融资', '20-99人', '微服务架构', '架构师', '高级软件工 程师', '后端开发', '定期体检，五险一金，绩效奖金，企业年金，带薪年假，年终奖，意外险，加班补助'], ['Java python上海·浦东新区·金桥', '20-30K', '1-3年', '本科', '汪先生工程师', '立即沟通', '上海华为技术有限公司', '通信/网络设备', '不需要融资', '10000人以上', 'Python', '后端开发', 'Java', '五险一金，加班补助，零食下午茶，带薪年假，股票期权，员工旅游，年终奖，节日福利，定期体检'], ['Java Developer上海·浦东新区·张江', '30-35K', '3-5年', '硕士', '程女士人事', '立即沟通', '花旗金融', '计算机软件', '不需要融资', '1000-9999人', 'Java', 'Shell', 'Spring', '补充医疗保险，购房贴息，定期体检，节日福利，五险一金，员工旅游，带薪年假，年终奖， 年金计划，带薪病假'], ['Java 工程师上海·长宁区·北新泾', '10-20K', '3-5年', '本科', '赵女士人事行政经理', '立即沟通', '购信', '互联网', '不需要融资', '20-99人', 'Java', 'Javascript'], ['JAVA DEVELOPER上海·浦东新区·世纪公园', '12-18K', '5-10年', '本科', '江女士人事', '立即沟通', '沃纳国际物流', '物流/仓储', '20-99人', 'Java', 'Javascript'], ['java 工程师上海·徐汇区·徐家汇', '12-24K', '3-5年', '大专', '徐先生运营总监', '立 即沟通', '琦亿科技', '媒体', '未融资', '20-99人', '多线程', '微服务架构', '网络协议', 'MVC开发', 'Spring', 'Dubbo', 'Redis', 'NoSQL', '年终奖，带薪年假，员工旅游，节日福利，五险一金，零食下午茶，免费班车'], ['JAVA 程序员上海·普陀区·长征', '7-8K', '经验不限', '本科', 'G女士人事', '立即沟通', '针知运', '贸易/进出口', '100-499人', 'SQL'], ['java 工程师上海·浦东新区·迪士尼', '8-13K', '1-3年', '大专', '丁女士招聘经理', '立即 沟通', '彦冕信息科技', '计算机软件', '未融资', '100-499人', '分布式技术', 'Dubbo', 'SpringMVC', 'Mybatis', 'Redis', '后端开发', 'springboot', 'springcloud', '年终奖，零食下午茶，员工旅游，定期体检，节日福利，餐补，五险一金，加班补助'], ['JAVA Web工程师上海·浦东新区·张江', '10-11K', '1-3年', '本科', '任先生人力资源', '立即沟通', '宜氪数据科技', '计算机软件', '未融资', '20-99人', 'JAVA', 'SpringBoot', 'HTML', 'CSS', 'SQL'], ['日语 Java 前端上海·浦东新区·陆家嘴', '15-20K·15薪', '3-5年', '本科', '邵先生招聘经理', '立即沟通', '励安', '企业服务', '0-20人', 'HTML', 'CSS', 'WEB开发', '微服务架构', 'js 前端 日语'], ['后端开发 JAVA上海·浦东新区·张江', '25-30K·15薪', '3-5年', '本科', '刘女士HR', '立即沟通', '喜马拉雅', '移动互联网', 'D轮及以上', '1000-9999人', 'Java', '带薪年假，补充医疗保险，免费班车，五险一金，年终奖，餐补，定期体检'], ['JAVA 后端技术开发上海·杨浦区·东外滩', '10-15K', '3-5年', '大专', '李先生HR', '立即沟通', '傲彭斯科技', '电子商务', '未融资', '20-99人', 'Spring', 'SpringBoot', 'SpringCloud', 'MySQL', 'WEB开发', 'Unix', '年终奖，节日福 利，员工旅游，全勤奖，五险一金，带薪年假'], ['JAVA 初级工程师上海·闵行区·浦江', '7-12K', '在校/应届', '本 科', '鲁先生招聘者', '立即沟通', '创度软件', '计算机软件', '未融资', '20-99人', '数据结构', 'Spring', 'SpringBoot', '员工旅游，带薪年假，餐补，年终奖，五险一金'], ['Java 开发工程师上海·普陀区·桃浦', '18-25K·13薪', '3-5年', '本科', '别先生项目经理', '立即沟通', '上海助医', '医疗健康', '不需要融资', '20-99人', 'Spring', 'Redis', 'GIT', 'SpringBoot', '后端开发', 'Java', 'Framework', 'SpringCloud', '年终奖，五险一金，定期体 检，通讯补贴，节日福利，带薪年假'], ['Java 高级工程师上海·虹口区·周家嘴路', '20-40K·15薪', '经验不限', '学历不限', '管先生招聘', '立即沟通', '得物App', '电子商务', 'B轮', '1000-9999人', 'Java', '后端开发', '节日 福利，零食下午茶，年终奖，股票期权，餐补，带薪年假，加班补助，五险一金，交通补助，绩效奖金，定期体检，生日福利'], ['Java 软件工程师上海·浦东新区·张江', '8-15K', '1-3年', '本科', '邹先生副总经理', '立即沟通', '上 海银帆信息科技', '计算机软件', '未融资', '20-99人', 'Java', '年终奖，零食下午茶，五险一金，定期体检，餐补 ，员工旅游，带薪年假'], ['Java 高级工程师上海·浦东新区·张江', '12-24K·13薪', '3-5年', '大专', '彭先生运营 总监', '立即沟通', '汉器', '企业服务', '天使轮', '20-99人', '分布式技术', '服务器配置', '微服务架构', 'Spring', 'SpringMVC', 'SpringCloud', 'MySQL', '全栈开发'], ['java 开发工程师上海·徐汇区·龙华', '14-20K·13薪', '3-5年', '本科', '段女士招聘经理', '立即沟通在线', '兴融联科技', '企业服务', '不需要融资', '100-499人', 'Java', 'Spring', 'MySQL', '零食下午茶，年终奖，餐补，员工旅游，带薪年假，节日福利，五险一金'], ['Software Engineer - Java上海·浦东新区·三林', '20-25K·15薪', '3-5年', '本科', '杨女士IT Application Head', '立即沟通', '默克', '制药', '已上市', '1000-9999人', 'Java', 'SQL', 'Spring', 'Hibernate', 'MVC开发', '服务器配置', 'MySQL', 'Oracle', '年终奖，带薪年假，补充医疗保险，节日福利，定期体检，五险一金'], ['JAVA 高级工程师上海·徐汇区·漕河泾', '15-25K·13薪', '5-10年', '学历不限', '施先生主管', '立即沟通在线', '晨光科力普', '电子商 务', '已上市', '1000-9999人', 'Java', 'C#', '后端开发', '五险一金，股票期权，交通补助，节日福利，员工旅游 ，年终奖，通讯补贴，零食下午茶'], ['Java 软件工程师上海·徐汇区·徐家汇', '6-9K·14薪', '1-3年', '大专', '孔 女士人事主管', '立即沟通', '华广生物', '医疗健康', '未融资', '500-999人', 'SQL', '多线程', '网络协议', 'Spring', 'Hibernate', 'Struts', 'SSH', 'SSM', '定期体检，带薪年假，年终奖，五险一金'], ['Java 开发工程师上海·浦东新区·世纪公园', '15-25K', '5-10年', '本科', '吴女士招聘者', '立即沟通', 'WeMeet 会多多', '移动互联网', '天使轮', '20-99人', '负载均衡技术', '分布式技术', '消息队列', '多线程', '架构师', '五险一金，带薪年假'], ['Java 算法工程师上海·静安区·火车站', '20-40K·13薪', '5-10年', '本科', '郭先生CTO', '立即沟通', '栈略数 据', '数据服务', 'C轮', '100-499人', 'Java', '后端开发', '机器学习', '定期体检，补充医疗保险，节日福利，加班补助，团建聚餐，带薪年假，五险一金'], ['Java 中级开发工程师上海·长宁区·仙霞', '13-18K·13薪', '1-3年', ' 本科', '颜先生研发主管', '立即沟通', '七云网络', '通信/网络设备', 'A轮', '100-499人', '后端工程师', 'Java', 'Spring', 'MyBatis', '计算机/软件工程相关经验', 'Java开发经验', '带薪年假，年终奖，员工旅游，五险一金'], ['Java 金融交易软件开发上海·浦东新区·陆家嘴', '20-30K', '5-10年', '本科', '熊女士总经理/技术总监', '立即 沟通', '雯品', '计算机软件', '0-20人', 'Java', 'MVC开发', 'Spring', 'SpringMVC', 'MySQL', '软件工程师', ' 英语', '人工智能', '五险一金'], ['Java 开发工程师上海·浦东新区·张江', '15-25K', '1-3年', '本科', '李女士运营经理', '立即沟通', '上海宝云网络', '互联网', 'B轮', '20-99人', 'SQL', '分布式技术', 'SpringBoot', 'SSM', 'SpringCloud', 'MySQL', 'Redis', '后端开发', '五险一金，定期体检，年终奖，包吃，带薪年假，股票期权，员工 旅游，节日福利，零食下午茶'], ['Java 开发工程师上海·浦东新区·临港', '40-65K', '10年以上', '本科', '王女士HR', '立即沟通在线', '特斯拉 Tesla', '汽车生产', '已上市', '10000人以上', 'Java', '零食下午茶，五险一金，加班补助，补充医疗保险，定期体检，节日福利，通讯补贴，免费班车，餐补，股票期权，住房补贴，年终奖，带薪年假'], ['JAVA 开发工程师上海·浦东新区·张江', '12-24K', '3-5年', '本科', '张先生研发总监', '立即沟通', '讯联', '互联网', 'C轮', '100-499人', '后端开发', 'Java', '零食下午茶，定期体检，节日福利，补充医疗保险，股票期权，年终奖，五险一金，餐补，带薪年假，员工旅游，交通补助']]


print(data)